       IDENTIFICATION DIVISION.
       PROGRAM-ID. "HELLOWORLD".
       AUTHOR. Sebastian
               * 8-11 A Margin
               * Columns 12-72 B Margin

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       0100-START-HERE.
             DISPLAY "HELLO WORLD!" .
       STOP RUN.
       END PROGRAM HELLOWORLD.

            
